Readme.md
```mermaid
classDiagram
direction BT
class Command {
<<Interface>>
  + execute() void
}
class CopyCommand {
  + getInstance(Editor) CopyCommand
  + execute() void
}
class CutCommand {
  + execute() void
  + getInstance(Editor) CutCommand
}
class Editor {
   String selectedTextText
   String copyBuffer
   JTextArea textArea
}
class JButton {
  # paramString() String
  + updateUI() void
  + removeNotify() void
  - writeObject(ObjectOutputStream) void
   String UIClassID
   AccessibleContext accessibleContext
   boolean defaultButton
   boolean defaultCapable
}
class MainEditor {
  + main(String[]) void
}
class PasteCommand {
  + getInstance(Editor) PasteCommand
  + execute() void
}
class SelectLeftCommand {
  + execute() void
  + getInstance(Editor) SelectLeftCommand
}
class SelectRightCommand {
  + execute() void
  + getInstance(Editor) SelectRightCommand
}

CopyCommand  ..>  Command 
CopyCommand "1" *--> "editor 1" Editor 
CutCommand  ..>  Command 
CutCommand "1" *--> "editor 1" Editor 
Editor  ..>  JButton : «create»
MainEditor  ..>  Editor : «create»
PasteCommand  ..>  Command 
PasteCommand "1" *--> "editor 1" Editor 
SelectLeftCommand  ..>  Command 
SelectLeftCommand "1" *--> "editor 1" Editor 
SelectRightCommand  ..>  Command 
SelectRightCommand "1" *--> "editor 1" Editor 
```
