Readme.md
```mermaid
classDiagram
direction BT
class CharacterReleaseCommand {
  + execute() void
  + toString() String
}
class Command {
<<Interface>>
  + execute() void
}
class CopyCommand {
  + getInstance(Editor) CopyCommand
  + execute() void
}
class CutCommand {
  + getInstance(Editor) CutCommand
  + execute() void
}
class Editor {
  - JTextArea textArea
  - String copyBuffer
   String selectedTextText
   String copyBuffer
   JTextArea textArea
}
class HistoryCommand {
  - int currentId
  - HistoryCommand instance
  - Stack~Pair~Command, String~~ historicStack
  + replay() Pair~Command, String~
  + push(Pair~Command, String~) void
  + toString() String
  + redo() Pair~Command, String~?
  + undo() Pair~Command, String~?
  + pop() Pair~Command, String~
   boolean empty
   Stack~Pair~Command, String~~ historicStack
   HistoryCommand instance
   int currentId
}
class MainEditor {
  + main(String[]) void
}
class Pair~K, V~ {
  - K key
  - V value
   V value
   K key
}
class PasteCommand {
  + getInstance(Editor) PasteCommand
  + execute() void
}
class SelectLeftCommand {
  + getInstance(Editor) SelectLeftCommand
  + execute() void
}
class SelectRightCommand {
  + getInstance(Editor) SelectRightCommand
  + execute() void
}

CharacterReleaseCommand  ..>  Command 
CharacterReleaseCommand "1" *--> "editor 1" Editor 
CopyCommand  ..>  Command 
CopyCommand "1" *--> "editor 1" Editor 
CutCommand  ..>  Command 
CutCommand "1" *--> "editor 1" Editor 
Editor  ..>  CharacterReleaseCommand : «create»
Editor "1" *--> "historyCommand 1" HistoryCommand 
Editor  ..>  Pair~K, V~ : «create»
HistoryCommand  ..>  CharacterReleaseCommand : «create»
HistoryCommand  ..>  Pair~K, V~ : «create»
MainEditor  ..>  Editor : «create»
PasteCommand  ..>  Command 
PasteCommand "1" *--> "editor 1" Editor 
SelectLeftCommand  ..>  Command 
SelectLeftCommand "1" *--> "editor 1" Editor 
SelectRightCommand  ..>  Command 
SelectRightCommand "1" *--> "editor 1" Editor 

```
